In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
xls = pd.ExcelFile('/content/KPMG_VI_New_raw_data_update_final.xlsx')

In [3]:
Transactions = pd.read_excel(xls, 'Transactions',header=None)
NewCustomerList = pd.read_excel(xls, 'NewCustomerList',header=None)
CustomerDemographic = pd.read_excel(xls, 'CustomerDemographic',header=None)
CustomerAddress = pd.read_excel(xls, 'CustomerAddress',header=None)

In [4]:
Transactions.columns=Transactions.loc[1].values.tolist()
NewCustomerList.columns=NewCustomerList.loc[1].values.tolist()
CustomerDemographic.columns=CustomerDemographic.loc[1].values.tolist()
CustomerAddress.columns=CustomerAddress.loc[1].values.tolist()

Transactions.drop([0,1],inplace=True)
NewCustomerList.drop([0,1],inplace=True)
CustomerDemographic.drop([0,1],inplace=True)
CustomerAddress.drop([0,1],inplace=True)

In [5]:
NewCustomerList = NewCustomerList.loc[:, NewCustomerList.columns.notnull()]

#Data Analysis of transaction table

In [10]:
Transactions.head()

  transaction_id product_id  ... standard_cost product_first_sold_date
2              1          2  ...         53.62                   41245
3              2          3  ...        388.92                   41701
4              3         37  ...        248.82                   36361
5              4         88  ...         381.1                   36145
6              5         78  ...        709.48                   42226

[5 rows x 13 columns]

In [11]:
Transactions.describe()

        transaction_id  product_id  ...  standard_cost product_first_sold_date
count            20000       20000  ...       19803.00                   19803
unique           20000         101  ...         103.00                     100
top              20000           0  ...         388.92                   33879
freq                 1        1378  ...         465.00                     234

[4 rows x 13 columns]

In [34]:
Transactions.product_class.value_counts()

medium    13826
high       3013
low        2964
Name: product_class, dtype: int64

#Data Anaysis with Customer Address Table

In [30]:
CustomerAddress.head()

  customer_id              address  ...    country property_valuation
2           1   060 Morning Avenue  ...  Australia                 10
3           2  6 Meadow Vale Court  ...  Australia                 10
4           4   0 Holy Cross Court  ...  Australia                  9
5           5  17979 Del Mar Point  ...  Australia                  4
6           6     9 Oakridge Court  ...  Australia                  9

[5 rows x 6 columns]

In [29]:
CustomerAddress.describe()

        customer_id                  address  ...    country property_valuation
count          3999                     3999  ...       3999               3999
unique         3999                     3996  ...          1                 12
top            4003  3 Mariners Cove Terrace  ...  Australia                  9
freq              1                        2  ...       3999                647

[4 rows x 6 columns]

#Data Analysis of Customer Demographic

In [37]:
CustomerDemographic.head()

  customer_id      first_name  ... owns_car tenure
2           1         Laraine  ...      Yes     11
3           2             Eli  ...      Yes     16
4           3           Arlin  ...      Yes     15
5           4          Talbot  ...       No      7
6           5  Sheila-kathryn  ...      Yes      8

[5 rows x 13 columns]

In [38]:
CustomerDemographic.describe()

        customer_id first_name last_name  ... default  owns_car tenure
count          4000       4000      3875  ...    3698      4000   3913
unique         4000       3139      3725  ...      90         2     22
top            4000       Tobe  Ramsdell  ...     100       Yes      7
freq              1          5         3  ...     113      2024    235

[4 rows x 13 columns]

In [41]:
CustomerDemographic.gender.unique()

array(['F', 'Male', 'Female', 'U', 'Femal', 'M'], dtype=object)

#Data Analysis with New Customer List table

In [42]:
NewCustomerList.head()

  first_name  last_name  gender  ... property_valuation Rank    Value
2    Chickie    Brister    Male  ...                  6    1  1.71875
3      Morly     Genery    Male  ...                 11    1  1.71875
4    Ardelis  Forrester  Female  ...                  5    1  1.71875
5     Lucine      Stutt  Female  ...                  1    4  1.70312
6    Melinda     Hadlee  Female  ...                  9    4  1.70312

[5 rows x 18 columns]

In [43]:
NewCustomerList.describe()

       first_name last_name  gender  ... property_valuation  Rank      Value
count        1000       971    1000  ...               1000  1000  1000.0000
unique        940       961       3  ...                 16   324   324.0000
top        Mandie     Borsi  Female  ...                  9   760     0.6375
freq            3         2     513  ...                173    13    13.0000

[4 rows x 18 columns]